Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: There are four sets of tags which can be used to denote blocks of PHP code.
pt_br: Há quatro conjuntos de tags que podem ser usadas para marcar blocos de código PHP.

source: Of these, only two (?php...? and script language="php "... / script) are always available; the others can be turned on or off from the php.ini Of these, only two (?php...? and script language="php"... / script) are always available; the others can be turned on or off from the php.ini configuration file.
pt_br: As outras podem ser ativadas ou desativadas a partir do arquivo de configuração php.ini.

source: While the short-form tags and ASP-style tags may be convenient, they are not as portable as the longer versions.
pt_br: Enquanto as formas reduzidas das tags ou no seu estilo ASP serem convenientes, elas não são portáveis em todas as versões.

source: Also, if you intend to embed PHP code in XML or XHTML, you will need to use the ?php...? form to conform to the XML.
pt_br: Além disso, se você pretende incluir código PHP em XML ou XHTML, você precisará usar a forma ?php...? para compatibilidade com o padrão XML.

source: The tags supported by PHP are:
pt_br: As tags suportadas pelo PHP são:

source: Example 6-1.
pt_br: Exemplo 6-1.

source: Ways of escaping from HTML
pt_br: Maneiras de alternar do HTML

# 1. ?php echo( "if you want to serve XHTML or XML documents, do like this ");?
source: 1. ?php echo( "if you want to serve XHTML or XML documents, do like this\n");?
pt_br: 1. ?php echo( "se você precisa dispor documentos XHTML ou XML, use assim\n");?

source: 2.? echo ("this is the simplest, an SGML processing instruction\n");? ?= expression?
pt_br: 2.? echo ("este é o mais simples, como uma instrução de processamento SGML\n");? ?= espressao?

source: This is a shortcut for "? echo expression?" 3. script language="php "echo ("some editors (like FrontPage) don't like processing instructions"); / script 4.% echo ("You may optionally use ASP-style tags");% %= $variable; # This is a shortcut for"% echo... "%
pt_br: Uma redução de "? echo expressao?" 3. script language="php "echo ("alguns editores (como o FrontPage) não gostam de processas instruções"); / script 4.% echo ("Você também pode usar tags ASP opcionalmente");% %= $variavel; # Uma redução para"% echo... "%

source: The first way, ?php...?, is the preferred method, as it allows the use of PHP in XML-conformant code such as XHTML.
pt_br: O primeiro método, ?php...?, é o preferencial, já que ele permite o uso do PHP em códigos padrão XML como o XHTML.

source: The second way is not available always.
pt_br: O segundo método pode não estar sempre disponível.

source: Short tags are available only when they have been enabled.
pt_br: Tags curtas estão disponíveis apenas quando ativadas.

source: This can be done via the short_tags() function (PHP 3 only), by enabling the short_open_tag configuration setting in the PHP config file, or by compiling PHP with the --enable-short-tags option to configure.
pt_br: Isto pode ser realizando através da função short_tags() (PHP 3 somente), ativando a diretiva de configuração short_open_tag no arquivo de configuração do PHP ou compilando o PHP com a opção --enable-short-tags no configure.

source: Even if it is enabled by default in php.ini-dist, use of short tags are discouraged.
pt_br: Mesmo que ele esteja configurado por default no php.ini-dist, o uso de tags curtas é desencorajado.

source: The fourth way is only available if ASP-style tags have been enabled using the asp_tags configuration setting.
pt_br: A quarta maneira só está disponível se a tag estilo ASP for ativada utilizando a diretiva asp_tags no arquivo de configuração.

source: Using short tags should be avoided when developing applications or libraries that are meant for redistribution, or deployment on PHP servers which are not under your control, because short tags may not be supported on the target server.
pt_br: A utilização das tags curtas deve ser evitada quando do desenvolvimento de aplicações ou bibliotecas com intenção de redistribuição ou no desenvolvimento de serviços em PHP que não ficarão sob seu controle, uma vez que as tags curtas podem não estar disponíveis no servidor de instalação.

source: For portable, redistributable code, be sure not to use short tags.
pt_br: Para portabilidade de código para distribuição, tenha certeza de não usar tags curtas.

source: The closing tag for the block will include the immediately trailing newline if one is present.
pt_br: A tag de fechamento incluirá uma linha nova linha em branco automaticamente se uma não estiver presente.

source: Also, the closing tag automatically implies a semicolon; you do not need to have a semicolon terminating the last line of a PHP block.
pt_br: Além, a tag de fechamento automaticamente implica num ponto e vírgula: você não precisa ter um ponto e vírgula no fim da última linha de código PHP.

source: PHP allows you to use structures like this:
pt_br: O PHP também suporta a utilização de estruturas como essa:

source: Example 6-2.
pt_br: Exemplo 6-2.

source: Advanced escaping
pt_br: Alternagem avançada

source: ?php if ($expression) {? strong This is true. / strong ?php} else {? strong This is false. / strong ?php}?
pt_br: ?php if ($expression) {? strong Isso é verdadeiro. / strong ?php} else {? strong Isto é falso. / strong ?php}?

source: Language Reference
pt_br: Referência da Linguagem

source: Instructions are separated the same as in C or Perl - terminate each statement with a semicolon.
pt_br: Instruções são separadas da mesma forma que o C ou o Perl - cada instrução termina com um ponto e vírgula.

source: The closing tag (?) also implies the end of the statement, so the following are equivalent:
pt_br: A tag de fechamento (?) também implica no fim de uma instrução, então os exemplos seguintes são equivalentes:

source: ?php echo "This is a test";? ?php echo "This is a test"?
pt_br: ?php echo "Isto é um teste";? ?php echo "Isto é um outro teste"?

source: Comments
pt_br: Comentários

source: A constant is a identifier (name) for a simple value.
pt_br: Constantes

source: As the name suggests, that value cannot change during the execution of the script (except the magic constants As the name suggests, that value cannot change during the execution of the script (except the magic constants which aren't actually constants).
pt_br: Como o nome sugere, esse valor não pode mudar durante a execução do script (as 'constantes mágicas '__FILE__ e __LINE__ parecem ser uma exceção a essa regra, mas elas não são realmente constantes).

source: A constant is case-sensitive by default.
pt_br: As constantes são sensíveis ao caso por padrão.

source: By convention constant identifiers are always uppercase.
pt_br: Por convenção, o nomes de constantes são sempre em maiúsculas.

source: The name of a constant follows the same rules as any label in PHP.
pt_br: O nome de uma constante tem as mesmas regras de qualquer identificador no PHP.

source: A valid constant name starts with a letter or underscore, followed by any number of letters, numbers, or underscores.
pt_br: Um nome de constante válida começa com uma letra ou sublinhado, seguido por qualquer número de letras, números ou sublinhados.

source: As a regular expression, it would be expressed thus: [a-zA-Z_\x7f-\xff][a-zA-Z0-9_\x7f-\xff ]*
pt_br: Em expressões regulares, ela pode ser representada por: [a-zA-Z_\x7f-\xff][a-zA-Z0-9_\x7f-\xff ]*

source: For our purposes here, a letter is a-z, A-Z, and the ASCII characters from 127 through 255 (0x7f-0xff).
pt_br: O escopo de uma constante é global.

source: The scope of a constant is global--you can access it anywhere in your script without regard to scope.
pt_br: Sintaxe

source: You can define a constant by using the define() -function.
pt_br: Você pode definir uma constante utilizando-se da função define().

source: Once a constant is defined, it can never be changed or undefined.
pt_br: Quando uma constante é definida, ela não pode ser mais modificada ou anulada.

source: Only scalar data (boolean, integer, float and string) can be contained in constants.
pt_br: Somente dados escalares (boolean, integer, float e string) pode ser colocados em constantes.

source: You can get the value of a constant by simply specifying its name.
pt_br: Você pode obter o valor de uma constante simplismente especificando seu nome.

source: Unlike with variables, you should not prepend a constant with a $.
pt_br: Diferentemente de variáveis, você não pode prefixar uma constante com um sinal de $.

source: You can also use the function constant(), to read a constant's value, if you are to obtain the constant's name dynamically.
pt_br: Você também pode utilizar a função constant() para ler o valor de uma constante, se você precisar obter seu valor dinamicamente.

source: Use get_defined_constants() to get a list of all defined constants.
pt_br: Utilize get_defined_constants() para obter a lista de todas as constantes definidas.

source: Constants and (global) variables are in a different namespace.
pt_br: As constantes e variáveis (globais) estão em espaços de nomes diferentes.

source: This implies that for example TRUE and $TRUE are generally different.
pt_br: Isto implica, por exemplo, que TRUE e $TRUE são geralmente diferentes.

source: If you use an undefined constant, PHP assumes that you mean the name of the constant itself.
pt_br: Se você usar uma constante indefinida, o PHP assume o nome da constante como seu próprio valor.

source: A notice will be issued when this happens.
pt_br: Uma notice será informada quando isso acontecer.

source: Use the defined() -function if you want to know if a constant is set.
pt_br: Use a função defined() se você precisar saber se uma constante está definida ou não.

source: These are the differences between constants and variables:
pt_br: Estas são as diferenças entre constantes e variáveis:

source: Constants do not have a dollar sign ($) before them;
pt_br: Constantes não podem ter um sinal de cifrão ($) antes delas;

source: Constants may only be defined using the define() function, not by simple assignment;
pt_br: Constantes só podem ser definidas utilizando a função define(), e não por simples assimilação;

source: Constants may be defined and accessed anywhere without regard to variable scoping rules;
pt_br: Constantes podem ser definidas e acessadas de qualquer lugar sem que a regras de escopo de variáveis seja aplicadas;

source: Constants may not be redefined or undefined once they have been set; and
pt_br: Constantes não podem ser redefinidas ou eliminadas depois que elas são criadas; e

source: Constants may only evaluate to scalar values.
pt_br: Constantes só podem conter valores escalares.

source: Example 9-1.
pt_br: Exemplo 9-1.

source: Defining Constants
pt_br: Definindo Constantes

source: ?php define( "CONSTANT", "Hello world ."); echo CONSTANT; / / outputs "Hello world. "echo Constant; / / outputs "Constant" and issues a notice.?
pt_br: ?php define( "CONSTANT", "Hello world ."); echo CONSTANT; / / imprime "Hello world. "echo Constant; / / imprime "Constant" e gera um alerta notice.?

source: Variables from outside PHP
pt_br: Variáveis externas ao PHP

source: Predefined constants
pt_br: Constantes Predefinidas

source: Chapter 9.
pt_br: Capítulo 9.

source: Constants
pt_br: Constantes

source: PHP provides a large number of predefined constants to any script which it runs.
pt_br: Constantes Predefinidas

source: There are four magical constants that change depending on where they 're used.
pt_br: O PHP fornece um grande número de constantes predefinidas para qualquer script que ele execute.

source: These special constants are case-insensitive and are as follows:
pt_br: A maioria dessas constantes, entretanto, são criadas por várias extensões, e somente estarão presentes quando essas extensões estiverem disponíveis, por carregamento dinamico ou por compilação direta.

source: A list of predefined constants is available in the section Reserved predefined constants.
pt_br: A lista de constantes predefinidas está disponível na seção Constantes Predefinidas.

source: Expressions
pt_br: Expressões

source: Expressions are the most important building stones of PHP.
pt_br: Expressões são as peças de construção mais importantes do PHP.

source: In PHP, almost anything you write is an expression.
pt_br: No PHP, quase tudo o que você escreve são expressões.

source: The simplest yet most accurate way to define an expression is "anything that has a value".
pt_br: A maneira mais simples e ainda mais precisa de definir uma expressão é "tudo o que tem um valor".

source: The most basic forms of expressions are constants and variables.
pt_br: As formas mais básicas de expressões são constantes e variáveis.

source: When you type "$a = 5", you're assigning '5 'into $a. '5', obviously, has the value 5, or in other words '5' is an expression with the value of 5 (in this case, '5 'is an integer constant).
pt_br: Quando você digita "$a = 5", você está atribuindo '5 'para $a. '5', obviamente, tem o valor 5, ou, em outras palavras, '5' é uma expressão com o valor 5 (neste caso, '5 'é uma constante inteira).

source: After this assignment, you' d expect $a's value to be 5 as well, so if you wrote $b = $a, you'd expect it to behave just as if you wrote $b = 5.
pt_br: Depois desta atribuição, você pode esperar que o valor de $a seja 5 também, assim se você escrever $b = $a, você pode esperar que $b se comporte da mesma forma que se você escrevesse $b = 5.

source: In other words, $a is an expression with the value of 5 as well.
pt_br: Em outras palavras, $a é uma expressão com valor 5 também.

source: If everything works right, this is exactly what will happen.
pt_br: Se tudo funcionou bem, isto é exatamente o que acontecerá.

source: Slightly more complex examples for expressions are functions.
pt_br: Exemplos ligeiramente mais complexos para expressões são as funções.

source: For instance, consider the following function:
pt_br: Por exemplo, considere a seguinte função:

source: Assuming you' re familiar with the concept of functions (if you're not, take a look at the chapter about functions), you'd assume that typing $c = foo() is essentially just like writing $c = 5, and you're right.
pt_br: Assumindo que você está familiarizado com o conceito de funções (se não estiver, dê uma olhada no capítulo sobre funções), você pode assumir que digitar $c = foo() é essencialmente a mesma coisa que escrever $c = 5, e você está certo.

source: Functions are expressions with the value of their return value.
pt_br: Funções são expressões com o valor igual ao seu valor de retorno.

source: Since foo() returns 5, the value of the expression'foo() 'is 5.
pt_br: Como foo() retorna 5, o valor da expressão 'foo() 'é 5.

source: Usually functions don 't just return a static value but compute something.
pt_br: Geralmente, as funções não retornam apenas um valor estático, mas computam algo.

source: Of course, values in PHP don' t have to be integers, and very often they aren't.
pt_br: Obviamente, os valores em PHP não têm que ser inteiros, e muito freqüentemente eles não são.

source: PHP supports three scalar value types: integer values, floating point values and string values (scalar values are values that you can't'break 'into smaller pieces, unlike arrays, for instance).
pt_br: O PHP suporta três tipos de valores escalares: valores inteiros, valores de ponto flutuante e valores de string (valores escalares são valores que você não pode quebrar em pedaços menores, diferente de matrizes, por exemplo).

source: PHP also supports two composite (non-scalar) types: arrays and objects.
pt_br: O PHP também suporta dois tipos compostos (não-escalares): matrizes e objetos.

source: Each of these value types can be assigned into variables or returned from functions.
pt_br: Cada um destes tipos de valor podem ser atribuídos a variáveis ou retornadas de funções.

source: So far, users of PHP / FI 2 shouldn 't feel any change.
pt_br: Até agora, os usuários de PHP / FI 2 não sentiriam qualquer mudança.

source: However, PHP takes expressions much further, in the same way many other languages do.
pt_br: Porém, o PHP traz expressões bem mais novas, da mesma forma que muitas outras linguagens.

source: PHP is an expression-oriented language, in the sense that almost everything is an expression.
pt_br: O PHP é uma linguagem orientada a expressões, no sentido de que quase tudo são expressões.

source: Consider the example we' ve already dealt with, '$a = 5 '.
pt_br: Considere o exemplo com o qual já lidamos, '$a = 5'.

source: It' s easy to see that there are two values involved here, the value of the integer constant '5 ', and the value of $a which is being updated to 5 as well.
pt_br: É fácil ver que há dois valores envolvidos aqui, o valor da constante inteira '5', e o valor de $a que está sendo atualizado para 5 também.

source: But the truth is that there' s one additional value involved here, and that's the value of the assignment itself.
pt_br: Mas a verdade é que há um valor adicional envolvido, e que é o próprio valor da atribuição.

source: The assignment itself evaluates to the assigned value, in this case 5.
pt_br: A própria atribuição é avaliada com o valor atribuído, neste caso 5.

source: In practice, it means that '$a = 5', regardless of what it does, is an expression with the value 5.
pt_br: Na prática, significa que '$a = 5', independente do que faça, é uma expressão com o valor 5.

source: Thus, writing something like '$b = ($a = 5)' is like writing '$a = 5; $b = 5; '(a semicolon marks the end of a statement).
pt_br: Portanto, escrever algo como '$b = ($a = 5)' é como escrever '$a = 5; $b = 5; '(um ponto-e-vírgula marca o fim do comando).

source: Since assignments are parsed in a right to left order, you can also write '$b = $a = 5'.
pt_br: Como atribuições são analisadas da direita para a esquerda, você também pode escrever '$b = $a = 5'.

source: Another good example of expression orientation is pre - and post-increment and decrement.
pt_br: Outro bom exemplo de orientação de expressão é o pré e o pós-incremento e decremento.

source: Users of PHP / FI 2 and many other languages may be familiar with the notation of variable+ + and variable--.
pt_br: Usuários de PHP / FI 2 e muitas outras linguagens podem estar familiarizados com a notação de variável+ + e variável--.

source: These are increment and decrement operators.
pt_br: Estes são os operadores de incremento e decremento.

source: In PHP / FI 2, the statement '$a++' has no value (is not an expression), and thus you can't assign it or use it in any way.
pt_br: No PHP / FI 2, o comando '$a++' não tem valor (não é uma expressão), e portanto você não pode atribuir desta forma ou usá-la de jeito nenhum.

source: PHP enhances the increment / decrement capabilities by making these expressions as well, like in C.
pt_br: O PHP evoluiu a capacidade de incremento / decremento criando estas expressões também, como em C.

source: In PHP, like in C, there are two types of increment - pre-increment and post-increment.
pt_br: Em PHP, como em C, há dois tipos de incremento - pré-incremento e pós-incremento.

source: Both pre-increment and post-increment essentially increment the variable, and the effect on the variable is idential.
pt_br: Tanto o pré-incremento quanto o pós-incremento, essencialmente, incrementam variáveis, e o efeito sobre a variável é idêntico.

source: The difference is with the value of the increment expression.
pt_br: A diferença é com o valor da expressão de incremento.

source: Pre-increment, which is written '++$variable', evaluates to the incremented value (PHP increments the variable before reading its value, thus the name'pre-increment').
pt_br: O pré-incremento, que é escrito '++$variavel', é avaliado como o valor de incremento (o PHP incrementa a variável antes de ler seu valor, por isso o nome pré-incremento).

source: Post-increment, which is written '$variable++' evaluates to the original value of $variable, before it was incremented (PHP increments the variable after reading its value, thus the name'post-increment').
pt_br: O pós-incremento, que é escrito '$variavel++' é avaliado como o valor original da variável, antes de ser incrementada (o PHP incrementa a variável depois de ler seu valor, por isso o nome 'pós-incremento').

source: A very common type of expressions are comparison expressions.
pt_br: Um tipo muito comum de expressão são expressões de comparação.

source: These expressions evaluate to either 0 or 1, meaning FALSE or TRUE (respectively).
pt_br: Estas expressões são avaliadas como 0 ou 1, significando FALSE ou TRUE, respectivamente.

source: PHP supports (bigger than), = (bigger than or equal to), == (equal), != (not equal), (smaller than) and = (smaller than or equal to).
pt_br: O PHP suporta (maior que), = (maior ou igual), == (igual), != (diferente), (menor que) e =(menor ou igual).

source: These expressions are most commonly used inside conditional execution, such as if statements.
pt_br: Estas expressões são usadas mais freqüentemente dentro de instruções condicionais, como em comandos if.

source: The last example of expressions we 'll deal with here is combined operator-assignment expressions.
pt_br: O último exemplo de expressões com que nós vamos lidar aqui são as expressões combinadas operador-atribuição.

source: You already know that if you want to increment $a by 1, you can simply write '$a++' or '++$a '.
pt_br: Você já sabe que se você quer incrementar $a de 1, você só precisa escrever '$a++' ou '++$a '.

source: But what if you want to add more than one to it, for instance 3?
pt_br: Mas e se você quiser somar mais que um a ele, por exemplo 3?

source: You could write '$a++' multiple times, but this is obviously not a very efficient or comfortable way.
pt_br: Você poderia escrever '$a++' várias vezes, mas esta obviamente não é uma forma muito eficiente ou confortável.

source: A much more common practice is to write '$a = $a + 3'. '$a + 3' evaluates to the value of $a plus 3, and is assigned back into $a, which results in incrementing $a by 3.
pt_br: Uma prática muito mais comum é escrever '$a = $a + 3'. '$a + 3' é avaliada como o valor de $a mais 3, e é atribuído de volta a $a, que resulta em incrementar $a de 3.

source: In PHP, as in several other languages like C, you can write this in a shorter way, which with time would become clearer and quicker to understand as well.
pt_br: Em PHP, como em várias outras linguagens como o C, você pode escrever isto de uma forma mais curta, que com o tempo se torna mais limpa e rápida de se entender, também.

source: Adding 3 to the current value of $a can be written '$a += 3'.
pt_br: Somar 3 ao valor corrente de $a pode ser escrito '$a +=3'.

source: In addition to being shorter and clearer, this also results in faster execution.
pt_br: Isto significa exatamente "pegue o valor de $a, some 3 a ele, e atribua-o de volta a $a." Além de ser mais curto e mais limpo, isto também resulta em execução mais rápida.

source: The value of '$a += 3', like the value of a regular assignment, is the assigned value.
pt_br: O valor de '$a += 3', como o valor de uma atribuição regular, é o valor atribuído.

source: Notice that it is NOT 3, but the combined value of $a plus 3 (this is the value that's assigned into $a).
pt_br: Note que NÃO é 3, mas o valor combinado de $a mais 3 (este é o valor que é atribuído a $a).

source: Any two-place operator can be used in this operator-assignment mode, for example '$a -= 5' (subtract 5 from the value of $a), '$b *= 7 '(multiply the value of $b by 7), etc.
pt_br: Qualquer operador de dois parâmetros pode ser usado neste modo operador-atribuição, por exemplo '$a -= 5' (subtrai 5 do valor de $a), '$b *= 7 '(multiplica o valor de $b por 7), etc.
